Ran Plan for dir: `terraform/kubernetes` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_record.kube_cp[1] will be created
+ resource "cloudflare_record" "kube_cp" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "cp.home.bryanwp.com"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "192.168.2.111"
      + zone_id         = "d2287afe1d6fbddb1a27e1a5b85b0288"
    }

  # cloudflare_record.kube_cp[2] will be created
+ resource "cloudflare_record" "kube_cp" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "cp.home.bryanwp.com"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "192.168.2.112"
      + zone_id         = "d2287afe1d6fbddb1a27e1a5b85b0288"
    }

  # proxmox_virtual_environment_file.cp_config will be destroyed
  # (because proxmox_virtual_environment_file.cp_config is not in configuration)
- resource "proxmox_virtual_environment_file" "cp_config" {
      - content_type   = "snippets" -> null
      - datastore_id   = "backup-nas" -> null
      - file_name      = "k3s-cp.cloud-config.yaml" -> null
      - id             = "backup-nas:snippets/k3s-cp.cloud-config.yaml" -> null
      - node_name      = "prox2" -> null
      - overwrite      = true -> null
      - timeout_upload = 1800 -> null

      - source_raw {
          - data      = <<-EOT
                #cloud-config
                write_files:
                runcmd:
                  - hostnamectl set-hostname $(cat /dev/urandom | tr -dc 'a-z0-9' | fold -w 8 | head -n 1)-k3s-cp
                  - curl -sfL https://get.k3s.io | sh -
            EOT -> null
          - file_name = "k3s-cp.cloud-config.yaml" -> null
          - resize    = 0 -> null
        }
    }

  # proxmox_virtual_environment_file.wk_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "wk_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "k3s-worker.cloud-config.yaml" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "backup-nas:snippets/k3s-worker.cloud-config.yaml" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = <<-EOT # forces replacement
                #cloud-config
                write_files:
                runcmd:
              -   - hostnamectl set-hostname $(cat /dev/urandom | tr -dc 'a-z0-9' | fold -w 8 | head -n 1)-k3s-worker
              -   #- curl -sfL https://get.k3s.io | sh - server --cluster-init
              -   - curl -sfL https://get.k3s.io | K3S_URL=https://cp.home.bryanwp.com:6443 K3S_TOKEN=mynodetoken sh -
              +   - hostnamectl set-hostname $(cat /dev/urandom | tr -dc 'a-z0-9' | fold -w 8 | head -n 1)-k3s-cp
              +   - curl -sfL https://get.k3s.io | K3S_URL=https://cp.home.bryanwp.com:6443 K3S_TOKEN=AU95q3+MP8bfQ== sh
            EOT
          ~ file_name = "k3s-worker.cloud-config.yaml" -> "k3s-cp.cloud-config.yaml" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # proxmox_virtual_environment_vm.kube_wk[0] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      ~ id                      = "550" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "192.168.2.120",
            ],
          - [
              - "10.42.4.0",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::20b9:beff:fef4:b6dc",
            ],
          - [
              - "fe80::dc31:6aff:fe7e:5b5c",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "22:B9:BE:F4:B6:DC",
          - "DE:31:6A:7E:5B:5C",
        ] -> (known after apply)
        name                    = "wk-polaris-0"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
          - "flannel.1",
        ] -> (known after apply)
      ~ tags                    = [
          - "k8s",
            "terraform",
          + "k8s",
            "wk",
        ]
        # (21 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (7 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-550-disk-0" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ initialization {
          - interface         = "ide2" -> null
          ~ user_data_file_id = "backup-nas:snippets/k3s-worker.cloud-config.yaml" # forces replacement -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ memory {
          ~ dedicated = 512 -> 4096
          ~ shared    = 512 -> 0
            # (1 unchanged attribute hidden)
        }

      ~ network_device {
          ~ mac_address = "22:B9:BE:F4:B6:DC" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_wk[1] will be created
+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "wk-polaris-1"
      + network_interface_names = (known after apply)
      + node_name               = "prox2"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "wk",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 551

      + clone {
          + full      = true
          + node_name = "prox2"
          + retries   = 1
          + vm_id     = 1002
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 4
          + hotplugged   = 0
          + numa         = false
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id      = "local-lvm"
          + user_data_file_id = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "192.168.2.121/32"
                  + gateway = "192.168.2.1"
                }
            }
        }

      + memory {
          + dedicated = 4096
          + floating  = 0
          + shared    = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + startup {
          + down_delay = 60
          + order      = 3
          + up_delay   = 60
        }
    }

  # proxmox_virtual_environment_vm.kube_wk[2] will be created
+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "wk-polaris-2"
      + network_interface_names = (known after apply)
      + node_name               = "pve"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "k8s",
          + "wk",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 552

      + clone {
          + full      = true
          + node_name = "prox2"
          + retries   = 1
          + vm_id     = 1002
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 4
          + hotplugged   = 0
          + numa         = false
          + sockets      = 1
          + type         = "qemu64"
          + units        = 1024
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id      = "local-lvm"
          + user_data_file_id = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "192.168.2.122/32"
                  + gateway = "192.168.2.1"
                }
            }
        }

      + memory {
          + dedicated = 4096
          + floating  = 0
          + shared    = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + startup {
          + down_delay = 60
          + order      = 3
          + up_delay   = 60
        }
    }

  # module.lxc-k8s-cp1.proxmox_virtual_environment_container.lxc will be updated in-place
~ resource "proxmox_virtual_environment_container" "lxc" {
      ~ description   = <<-EOT
            Managed by Terraform
        EOT
        id            = "500"
        tags          = []
        # (6 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.lxc-k8s-cp2.proxmox_virtual_environment_container.lxc will be updated in-place
~ resource "proxmox_virtual_environment_container" "lxc" {
      ~ description   = <<-EOT
            Managed by Terraform
        EOT
        id            = "501"
        tags          = []
        # (6 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.lxc-k8s-cp3.proxmox_virtual_environment_container.lxc will be updated in-place
~ resource "proxmox_virtual_environment_container" "lxc" {
      ~ description   = <<-EOT
            Managed by Terraform
        EOT
        id            = "502"
        tags          = []
        # (6 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

Plan: 6 to add, 3 to change, 3 to destroy.
╷
│ Warning: Redundant empty provider block
│ 
│   on .terraform/modules/lxc-k8s-cp1/proxmox/lxc/data.tf line 1:
│    1: provider "http" {
│ 
│ Earlier versions of Terraform used empty provider blocks ("proxy provider
│ configurations") for child modules to declare their need to be passed a
│ provider configuration by their callers. That approach was ambiguous and is
│ now deprecated.
│ 
│ If you control this module, you can migrate to the new declaration syntax
│ by removing all of the empty provider "http" blocks and then adding or
│ updating an entry like the following to the required_providers block of
│ module.lxc-k8s-cp1:
│     http = {
│       source = "hashicorp/http"
│       configuration_aliases = [
│         http.github,
│       ]
│     }
│ 
│ (and 2 more similar warnings elsewhere)
╵
╷
│ Warning: Deprecated attribute
│ 
│   on .terraform/modules/lxc-k8s-cp1/proxmox/lxc/lxc.tf line 31, in resource "proxmox_virtual_environment_container" "lxc":
│   31:         data.http.github_ssh_key.body
│ 
│ The attribute "body" is deprecated. Refer to the provider documentation for
│ details.
│ 
│ (and 5 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/kubernetes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://c79e3cbba2de:4141/lock?id=resnostyle%252Fk8s-gitops%252Fterraform%252Fkubernetes%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/kubernetes`
</details>
Plan: 6 to add, 3 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`